Repository: KLO128/KLO128.Calculator
Catalog: KLO128.Calculator.Domain.Shared/Translations.*.resx
Languages: cs_cz

source: About
cs_cz: O Aplikaci

source: Advanced Operators
cs_cz: Rozšířené operátory

source: Application Version
cs_cz: Verze aplikace

source: Calculator
cs_cz: Kalkulačka

source: Compute
cs_cz: Spočítat

source: Error
cs_cz: Chyba

# exp001
source: Could not find the culture specified: {0}
cs_cz: Nepodařilo se najít požadovaný jazyk: {0}

# exp002
source: Operation cannot start with operator '{0}'.
cs_cz: Operace nemůže začínat operátorem '{0}'.

# exp003
source: Too many operands.
cs_cz: Příliš mnoho operandů.

# exp004
source: The number is in invalid format: {0} ...at index: {1}
cs_cz: Číslo je v nesprávném formátu: {0} ...na indexu: {1}

# exp005
source: Not supported operation: '{0}' ...at index: {1}
cs_cz: Nepodporovaná operace: '{0}' ...na indexu: {1}

# exp006
source: Invalid expression: Too many operands in binary expression. Expected an operator near the operand: {0}... at index: {1}.
cs_cz: Neplatný výraz: Příliš mnoho operandů v binární operaci. Očekával se operátor v blízkosti operandu: {0}... na indexu: {1}.

# exp007
source: Unexpected token occurred '{0}' at index: {1}
cs_cz: Neočekávaný symbol '{0}' na indexu: {1}

# exp008
source: Missing operand in binary expression... at index: {0}
cs_cz: Chybějící operand v binární operaci... na indexu: {0}

# exp009
source: Missing closing bracket... Context starts at index: {0}
cs_cz: Chybí uzavírací závorka... Začátek kontextu na indexu: {0}

# exp010
source: Too many operators at index {0}. Unexpected operator: {1}
cs_cz: Příliš mnoho operátorů na indexu {0}. Neočekávaný operátor: {1}

# exp011
source: Missing oppenning bracket... Context ends at index: {0}
cs_cz: Chybí otevírací závorka... Kontext končí at indexu: {0}

source: History
cs_cz: Historie

source: Home
cs_cz: Domů

source: Loading...
cs_cz: Načítání...

source: More
cs_cz: Více

# msgAbout
source: This application is able to compute any constant complex binary expression using supported operators and brackets. It can also pretify or normalize the expression and the result as well as it displays a history from cookies.
cs_cz: Tato aplikace je schopná vypočítat jakýkoliv konstantní složený binární výraz s použitím podporovaných operátorů a závorek. Umožňuje také zkrášlit nebo normalizovat výraz a výsledek. Dále zobrazuje historii z cookies.

# msgExpressionRequired
source: The expression field is required.
cs_cz: Pole výrazu je vyžadováno.

# msgResultAsInteger
source: Display Result as Integer
cs_cz: Výsledek zobrazit jako celé číslo

# msgServerNotResponding
source: The server is not responding...
cs_cz: Server neodpovídá...

# msgSwitchToHttps
source: Switch protocol to https for preservation of history...
cs_cz: Přejít na protokol https pro zachování historie...

source: No History
cs_cz: Žádná historie

source: Prettify
cs_cz: Zkrášlit

source: Refresh
cs_cz: Obnovit

source: Result
cs_cz: Výsledek

source: Use Thousand Separators
cs_cz: Používat oddělovače tisíců

source: Web Api Version
cs_cz: Verze Web Api
